# StackOverflow 问答 13430000-13430999

# asp.net - 通过使用 Visual Studio 组合表格的两列来设置唯一键

> ID：13430005
> 
> 赞同：2
> 
> 时间：2012-11-17T11:13:12.533
> 
> 标签：asp.net, database, visual-studio-2010

我想通过使用 Visual Studio for Asp.net 网站组合表的两列来创建唯一键。我在 MySql 命令提示符的帮助下知道该方式，但在 Visual Studio 中我不知道图形方式。

请帮我..

# parameters - 错误“未引用形式参数“G””

> ID：13430006
> 
> 赞同：1
> 
> 时间：2012-11-17T11:13:35.400
> 
> 标签：parameters, ada

我在编译代码时收到错误消息“parsing.adb:22:32: 警告：未引用形式参数“G””。知道我必须更改什么才能收到此错误消息吗？

这是我的代码：

```
with Ada.Text_IO, Ada.Integer_Text_IO, Life, parsing;
use Ada.Text_IO, Ada.Integer_Text_IO, Life, parsing;

package body Parsing is

Parsing_Failed : exception;

type New_Grid is record
Hauteur : Natural;
Largeur : Natural;
Tableau : Grid;
end record;

   procedure Grid_Load_LIF(G : out Grid ; File_Name : in String) is
    Fichier:File_Type;
    Ligne:String(1..75);
    Grille : New_Grid;
    Num_Ligne : Positive := 1;
    Lu : Natural:=0;
begin
open(Fichier, In_File, File_Name);

while not End_of_File(Fichier) loop
    get_Line(Fichier, Ligne, Lu);

for i in 1..Lu loop
    if ligne(I) = '*' then
        grille.Tableau(Num_Ligne,I) := True;
    elsif ligne(I)= '.' then
        grille.Tableau(Num_Ligne,I) := False;

    end if;
end loop;
Num_Ligne := Num_Ligne +1;
grille.Largeur := Lu;
grille.Hauteur := Num_Ligne;

end loop;
end Grid_Load_LIF;

end Parsing; 
```

谢谢你的帮助 ！

* * *

## 回答 #1

> 赞同：2
> 
> 时间：2012-11-17T16:20:53.940

我认为您可能需要更改`Grid_Load_LIF`为

```

这让我觉得“有趣”，因此我不得不在这个问题上四处寻找......它仍然是一个“正在进行的答案”，但想发布我所需要帮助其他人想出的东西。:)

另外，我有一个粗略的感觉，这在 FAT32 上会更容易，但考虑到我只有 NTFS 可以使用......

所以 -**大量**的 pinvoking 和编组，所以让我们从那里开始并向后工作：

有人可能会猜到，标准的 .NET File/IO api 在这里对您没有多大帮助 - 我们需要*设备级*访问：

```
[DllImport("kernel32.dll", SetLastError = true, CharSet = CharSet.Auto)]
static extern SafeFileHandle CreateFile(
    string lpFileName,
    [MarshalAs(UnmanagedType.U4)] FileAccess dwDesiredAccess,
    [MarshalAs(UnmanagedType.U4)] FileShare dwShareMode,
    IntPtr lpSecurityAttributes,
    [MarshalAs(UnmanagedType.U4)] FileMode dwCreationDisposition,
    [MarshalAs(UnmanagedType.U4)] FileAttributes dwFlagsAndAttributes,
    IntPtr hTemplateFile);

[DllImport("kernel32.dll", CharSet = CharSet.Auto, SetLastError = true)]
public static extern bool ReadFile(
    SafeFileHandle hFile,      // handle to file
    byte[] pBuffer,        // data buffer, should be fixed
    int NumberOfBytesToRead,  // number of bytes to read
    IntPtr pNumberOfBytesRead,  // number of bytes read, provide NULL here
    ref NativeOverlapped lpOverlapped // should be fixed, if not null
);

[DllImport("Kernel32.dll", SetLastError = true, CharSet = CharSet.Auto)]
public static extern bool SetFilePointerEx(
    SafeFileHandle hFile,
    long liDistanceToMove,
    out long lpNewFilePointer,
    SeekOrigin dwMoveMethod); 
```

因此，我们将使用这些讨厌的 win32 野兽：

```
// To the metal, baby!
using (var fileHandle = NativeMethods.CreateFile(
    // Magic "give me the device" syntax
    @"\\.\c:",
    // MUST explicitly provide both of these, not ReadWrite
    FileAccess.Read | FileAccess.Write,
    // MUST explicitly provide both of these, not ReadWrite
    FileShare.Write | FileShare.Read,
    IntPtr.Zero,
    FileMode.Open,
    FileAttributes.Normal,
    IntPtr.Zero))
{
    if (fileHandle.IsInvalid)
    {
        // Doh!
        throw new Win32Exception();
    }
    else
    {
        // Boot sector ~ 512 bytes long
        byte[] buffer = new byte[512];
        NativeOverlapped overlapped = new NativeOverlapped();
        NativeMethods.ReadFile(fileHandle, buffer, buffer.Length, IntPtr.Zero, ref overlapped);

        // Pin it so we can transmogrify it into a FAT structure
        var handle = GCHandle.Alloc(buffer, GCHandleType.Pinned);
        try
        {
            // note, I've got an NTFS drive, change yours to suit
            var bootSector = (BootSector_NTFS)Marshal.PtrToStructure(
                 handle.AddrOfPinnedObject(), 
                 typeof(BootSector_NTFS)); 
```

哇，哇哇 - 到底是什么`BootSector_NTFS`？它是一个字节映射`struct`，尽可能接近 NTFS 结构的样子（包括 FAT32）：

```
[StructLayout(LayoutKind.Sequential, CharSet=CharSet.Ansi, Pack=0)]
public struct JumpBoot
{
    [MarshalAs(UnmanagedType.ByValArray, ArraySubType=UnmanagedType.U1, SizeConst=3)]
    public byte[] BS_jmpBoot;
    [MarshalAs(UnmanagedType.ByValTStr, SizeConst=8)]
    public string BS_OEMName;
}

[StructLayout(LayoutKind.Explicit, CharSet = CharSet.Ansi, Pack = 0, Size = 90)]
public struct BootSector_NTFS
{
    [FieldOffset(0)]
    public JumpBoot JumpBoot;
    [FieldOffset(0xb)]
    public short BytesPerSector;
    [FieldOffset(0xd)]
    public byte SectorsPerCluster;
    [FieldOffset(0xe)]
    public short ReservedSectorCount;
    [FieldOffset(0x10)]
    [MarshalAs(UnmanagedType.ByValArray, SizeConst = 5)]
    public byte[] Reserved0_MUSTBEZEROs;
    [FieldOffset(0x15)]
    public byte BPB_Media;
    [FieldOffset(0x16)]
    public short Reserved1_MUSTBEZERO;
    [FieldOffset(0x18)]
    public short SectorsPerTrack;
    [FieldOffset(0x1A)]
    public short HeadCount;
    [FieldOffset(0x1c)]
    public int HiddenSectorCount;
    [FieldOffset(0x20)]
    public int LargeSectors;
    [FieldOffset(0x24)]
    public int Reserved6;
    [FieldOffset(0x28)]
    public long TotalSectors;
    [FieldOffset(0x30)]
    public long MftClusterNumber;
    [FieldOffset(0x38)]
    public long MftMirrorClusterNumber;
    [FieldOffset(0x40)]
    public byte ClustersPerMftRecord;
    [FieldOffset(0x41)]
    public byte Reserved7;
    [FieldOffset(0x42)]
    public short Reserved8;
    [FieldOffset(0x44)]
    public byte ClustersPerIndexBuffer;
    [FieldOffset(0x45)]
    public byte Reserved9;
    [FieldOffset(0x46)]
    public short ReservedA;
    [FieldOffset(0x48)]
    [MarshalAs(UnmanagedType.ByValArray, SizeConst = 8)]
    public byte[] SerialNumber;
    [FieldOffset(0x50)]
    public int Checksum;
    [FieldOffset(0x54)]
    [MarshalAs(UnmanagedType.ByValArray, SizeConst = 0x1AA)]
    public byte[] BootupCode;
    [FieldOffset(0x1FE)]
    public ushort EndOfSectorMarker;

    public long GetMftAbsoluteIndex(int recordIndex = 0)
    {
        return (BytesPerSector * SectorsPerCluster * MftClusterNumber) + (GetMftEntrySize() * recordIndex);
    }
    public long GetMftEntrySize()
    {
        return (BytesPerSector * SectorsPerCluster * ClustersPerMftRecord);
    }
}

// Note: dont have fat32, so can't verify all these...they *should* work, tho
// refs:
//    http://www.pjrc.com/tech/8051/ide/fat32.html
//    http://msdn.microsoft.com/en-US/windows/hardware/gg463084
[StructLayout(LayoutKind.Explicit, CharSet=CharSet.Auto, Pack=0, Size=90)]
public struct BootSector_FAT32
{
    [FieldOffset(0)]
    public JumpBoot JumpBoot;    
    [FieldOffset(11)]
    public short BPB_BytsPerSec;
    [FieldOffset(13)]
    public byte BPB_SecPerClus;
    [FieldOffset(14)]
    public short BPB_RsvdSecCnt;
    [FieldOffset(16)]
    public byte BPB_NumFATs;
    [FieldOffset(17)]
    public short BPB_RootEntCnt;
