# StackOverflow 问答 14315000-14315999

# c++ - Windows下多个用户登录时如何获取活动用户？

> ID：14315013
> 
> 赞同：3
> 
> 时间：2013-01-14T08:06:46.080
> 
> 标签：c++, windows

假设当前有多个用户登录 Windows。说，`user1`登录，然后`switch user`登录`user2`，（不`user1`注销）。假设有一个应用程序在用户登录时运行。有两个用户`user1`并以活动用户身份`user2`登录`user2`，并且有两个应用程序。

我的问题是：应用程序如何知道其对应的用户是否处于活动状态？即，`user2`域中的应用程序确定其用户处于活动状态，而`user1`域中的应用程序确定其用户当前处于非活动状态。谢谢！

* * *

## 回答 #1

> 赞同：4
> 
> 时间：2013-01-14T20:46:58.940

您可以调用[`WTSGetActiveConsoleSessionId`](http://msdn.microsoft.com/en-us/library/aa383835%28v=vs.85%29.aspx)以获取当前在物理控制台上处于活动状态的终端服务（又名“快速用户切换”又名“远程桌面”）会话 ID。

您可以调用[`WTSQuerySessionInformation`](http://msdn.microsoft.com/en-us/library/aa383838%28v=vs.85%29.aspx)with`WTS_CURRENT_SESSION`获取会话标识符和`WTSSessionId`获取`WTSInfoClass`当前进程的终端服务会话 ID。

如果活动会话ID和当前进程会话ID相同，则当前进程对应的用户在物理控制台上具有活动会话。

如果您想知道当前进程正在运行的会话是否处于活动状态（但不一定在物理控制台上），您可以改为`WTSConnectState`使用`WTSQuerySessionInformation`.

* * *

## 回答 #2

> 赞同：4
> 
> 时间：2016-02-09T17:00:44.697

WTSGetActiveConsoleSessionId() 从 Windows 服务运行时实际上可能返回会话 0。如果您需要从 Windows 服务执行此操作，则需要枚举所有会话并找到连接的会话，然后从中获取用户。

下面的代码做的远不止这些，包括模拟该用户并以该用户身份运行一个进程，所有这些都来自 Windows 服务，但如果您只对用户名感兴趣，请查找调用 WTSQuerySessionInformation() 函数的第二个实例.

```
//Function to run a process as active user from windows service
void ImpersonateActiveUserAndRun(WCHAR* path, WCHAR* args)
{
    DWORD session_id = -1;
    DWORD session_count = 0;

    WTS_SESSION_INFOA *pSession = NULL;


     <add name="ScriptModule" type="System.Web.Handlers.ScriptModule, System.Web.Extensions, Version=3.5.0.0, Culture=neutral, PublicKeyToken=31BF3856AD364E35"/> 
</httpModules> 
```

当我使用框架 4.0 将其添加到应用程序的 web.config 时，应用程序无法正常工作，并且出现 500 - 内部服务器错误，当我删除应用程序上方的代码时，应用程序运行良好。

有什么我想念的吗（添加参考或其他东西）？！！！

# c++ - 函数“atomic_add_32_nv”必须有原型

> ID：14315253
> 
> 赞同：1
> 
> 时间：2013-01-14T08:40:55.743
> 
> 标签：c++

C++ 比较了我的功能。

在“solaris 5.10”中，一切正常！但是在“solaris 5.9”中，如果我没有原型，它会给我错误“函数“atomic_add_32_nv”必须有原型。”

请帮我！

* * *

## 回答 #1

> 赞同：0
> 
> 时间：2013-01-14T11:06:39.847

`<atomic.h>`据我记得，原子函数支持（通过）是在 Solaris 10 中添加的。谷歌搜索“solaris 10 atomic operations”似乎通过各种点击来支持这一点。

在 Solaris 9 上，您要么需要使用互斥锁（这比原子操作慢得多；但对您的应用程序可能无关紧要）提供包装器，要么使用汇编器实现这些功能（每个处理器/架构 x86/sparc，您需要支持）。

您还可以看看常见的开源项目（例如 apache httpd、boost）是如何做到这一点并从那里开始的。

有关相关讨论，请参阅[此](https://stackoverflow.com/q/7784128/21567)SO 主题。

# c++ - 来自 OSX 应用程序的 Mkdir

> ID：14315255
> 
> 赞同：1
> 
> 时间：2013-01-14T08:41:03.830
> 
> 标签：c++, macos, osx-snow-leopard

我是 OSX 开发的新手，我需要你的帮助。

我正在尝试使用我用 C++ 编写的 OSX 应用程序中的 mkdir 在 /private/var/tmp 上创建文件夹。我在 OSX 10.6 上使用 XCode 3.2.6。该命令运行良好。该文件夹在路径 /private/var/tmp 中创建。

这就是我在应用程序中所做的：`mkdir(my_path, 0777);`

但是我的文件夹权限有问题。用户可以修改文件夹（在里面创建另一个文件夹等），但不能修改“everyone”或“wheel”。

![在此处输入图像描述](../Images/f8ef23d3ac5ef992de51c43e8a22548a.png)

翻译 ：

*   莫伊->我
*   Lecture et écriture -> 读写
*   Lecture seulement -> 只读

我尝试从终端创建文件夹，我输入 mkdir -m 777 /private/var/tmp/ **test**并且文件夹**test**具有良好的权限：

![在此处输入图像描述](../Images/9c6fbfa1ab4c3651e6feb588212ce442.png)

翻译 ：

*   莫伊->我
*   Lecture et écriture -> 读写

我的问题是，我怎样才能对文件夹和我的 OSX 应用程序进行写权限。

谢谢你。

* * *

## 回答 #1

> 赞同：1
> 
> 时间：2013-01-14T09:04:22.813

根据[SUIS](http://pubs.opengroup.org/onlinepubs/009695399/functions/mkdir.html)

> mkdir() 函数将创建一个名为 path 的新目录。新目录的文件权限位应从 mode 初始化。**mode 参数的这些文件权限位应由进程的文件创建掩码修改。**

原因是为您的系统定义的默认[umask 。](http://en.wikipedia.org/wiki/Umask)

因此，您只需在调用 mkdir 或调用[chown之前从进程中更新](http://pubs.opengroup.org/onlinepubs/000095399/functions/chown.html)[umask](http://pubs.opengroup.org/onlinepubs/009695399/functions/umask.html)即可更新已创建文件夹的属性。

# windows - _IMAGE_DOS_HEADER 符号未找到

> ID：14315257
> 
> 赞同：1
> 
> 时间：2013-01-14T08:41:25.040
> 
> 标签：windows, debugging, windbg

我最近在 Vmware 的 Windows 7 中安装了 windbg .. 安装了 Windows SDK 和 Windows 符号。

但是当我在 windbg 中打开可执行文件“notepad.exe”并运行以下 dt _IMAGE_DOS_HEADER 命令时，它仍然显示未找到符号。

我已经设置了 PATH _NT_SYMBOL_PATH=SMVSRV*c:\Symbols*http://msdl.microsoft.com/download/symbols

在 Windows XP 上尝试了同样的方法......同样的问题..

请指教。

谢谢 ！

* * *

## 回答 #1

> 赞同：3
> 
> 时间：2013-01-15T11:03:49.560

将其设置为**srv*** *http://msdl.microsoft.com/download/symbols。尽管文档在说什么，前缀**symsrv**对我不起作用，而**srv**可以：

```
 0:000> .sympath srv**http://msdl.microsoft.com/download/symbols
Symbol search path is: srv**http://msdl.microsoft.com/download/symbols
Expanded Symbol search path is: srv**http://msdl.microsoft.com/download/symbols
0:000> .reload
Reloading current modules
...................
0:000> dt _IMAGE_DOS_HEADER
ntdll!_IMAGE_DOS_HEADER
   +0x000 e_magic          : Uint2B
   +0x002 e_cblp           : Uint2B
   +0x004 e_cp             : Uint2B
   +0x006 e_crlc           : Uint2B
   +0x008 e_cparhdr        : Uint2B
   +0x00a e_minalloc       : Uint2B
   +0x00c e_maxalloc       : Uint2B
   +0x00e e_ss             : Uint2B
   +0x010 e_sp             : Uint2B
   +0x012 e_csum           : Uint2B
   +0x014 e_ip             : Uint2B
   +0x016 e_cs             : Uint2B
   +0x018 e_lfarlc         : Uint2B
   +0x01a e_ovno           : Uint2B
   +0x01c e_res            : [4] Uint2B
   +0x024 e_oemid          : Uint2B
   +0x026 e_oeminfo        : Uint2B
   +0x028 e_res2           : [10] Uint2B
   +0x03c e_lfanew         : Int4B
0:000> 
```

# asp.net-mvc - 为什么我的 MVC 4 授权检查会引发异常？

> ID：14315259
> 
> 赞同：1
> 
> 时间：2013-01-14T08:41:46.693
> 
> 标签：asp.net-mvc, asp.net-mvc-4, forms-authentication

我正在使用带有 SQL Server Express 2012 的 Visual Studio 2012。我使用“Internet 应用程序”模板创建了一个 MVC 4 Web 应用程序。

我想在我的 SQL Server 2012 Express 实例上使用现有数据库（而不是模板的 MDF）。我已修改我的 web.config 以指向我的本地 SQL express 实例，并删除了模板生成的 MDF。我的 Web.Config 有：

```
<add name="DefaultConnection" 
    connectionString="Data Source=.\SQLEXPRESS;Initial Catalog=Administration;Integrated Security=SSPI;" providerName="System.Data.SqlClient"/> 
```

股票会员代码有一个初始化数据库的调用：

```
WebSecurity.InitializeDatabaseConnection("DefaultConnection", "UserProfile", "UserId", "UserName", autoCreateTables: true); 
```

一旦应用程序启动，这些表就会在管理数据库中创建，正如我所期望的那样。我可以创建用户并在管理中填充它们。我可以通过代码填充角色表并将角色添加到用户的配置文件并验证它是否已完成。例如：

```
Roles.GetRolesForUser("kristian"); // = string[] { "Administrator" } 
```

但是，如果我尝试使用基于角色的授权，例如：

```
[Authorize(Roles = "Administrator")] 
